load_generator/test-gradual-4m.yml
config:
  target: 'http://10.89.186.87:31112'
  http:
    timeout: 120

  phases:
    - arrivalRate: 0.2
      duration: 60
    - arrivalRate: 0.4
      duration: 60
    - arrivalRate: 0.6
      duration: 60
    - arrivalRate: 0.8
      duration: 60
    - arrivalRate: 1
      duration: 240
    - arrivalRate: 0.8
      duration: 60
    - arrivalRate: 0.6
      duration: 60
    - arrivalRate: 0.4
      duration: 60
    - arrivalRate: 0.2
      duration: 60
    - arrivalRate: 0.1
      duration: 480

  processor: "./metrics.js"
scenarios:
  - flow:
      - get:
          url: "/function/pycon"
          beforeRequest: "beforeRequest"
          afterResponse: "afterResponse"