load_generator/test.yml
config:
  target: 'http://10.89.186.61:31112'
  http:
    timeout: 60
  phases:
   - name: "p0"
     duration: 100
     arrivalRate: 1
   - name: "p1"
     arrivalRate: 1
     rampTo: 3
     duration: 300
   - name: "p2"
     duration: 300
     arrivalRate: 3
  processor: "./metrics.js"
scenarios:
  - flow:
      - get:
          url: "/function/pycon"
          beforeRequest: "beforeRequest"
          afterResponse: "afterResponse"